Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
tering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-g_variants will be created
  + resource "aws_api_gateway_resource" "datasets-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-individuals will be created
  + resource "aws_api_gateway_resource" "datasets-id-individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.dportal will be created
  + resource "aws_api_gateway_resource" "dportal" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "dportal"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.dportal_proxy will be created
  + resource "aws_api_gateway_resource" "dportal_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.entry_types will be created
  + resource "aws_api_gateway_resource" "entry_types" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "entry_types"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.filtering_terms will be created
  + resource "aws_api_gateway_resource" "filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants will be created
  + resource "aws_api_gateway_resource" "g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id will be created
  + resource "aws_api_gateway_resource" "g_variants-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_resource" "g_variants-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id-individuals will be created
  + resource "aws_api_gateway_resource" "g_variants-id-individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals will be created
  + resource "aws_api_gateway_resource" "individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-filtering_terms will be created
  + resource "aws_api_gateway_resource" "individuals-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id will be created
  + resource "aws_api_gateway_resource" "individuals-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id-biosamples will be created
  + resource "aws_api_gateway_resource" "individuals-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id-g_variants will be created
  + resource "aws_api_gateway_resource" "individuals-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.info will be created
  + resource "aws_api_gateway_resource" "info" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "info"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.map will be created
  + resource "aws_api_gateway_resource" "map" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "map"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.projects will be created
  + resource "aws_api_gateway_resource" "projects" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "projects"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs will be created
  + resource "aws_api_gateway_resource" "runs" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "runs"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-filtering_terms will be created
  + resource "aws_api_gateway_resource" "runs-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-id will be created
  + resource "aws_api_gateway_resource" "runs-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-id-analyses will be created
  + resource "aws_api_gateway_resource" "runs-id-analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-id-g_variants will be created
  + resource "aws_api_gateway_resource" "runs-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_rest_api.BeaconApi will be created
  + resource "aws_api_gateway_rest_api" "BeaconApi" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API That implements the Beacon specification"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "sbeacon-backend-api"
      + policy                       = (known after apply)
      + region                       = "ap-southeast-3"
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.sbeacon.aws_athena_workgroup.sbeacon-workgroup will be created
  + resource "aws_athena_workgroup" "sbeacon-workgroup" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "query_workgroup"
      + region        = "ap-southeast-3"
      + state         = "ENABLED"
      + tags_all      = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + configuration {
          + enable_minimum_encryption_configuration = (known after apply)
          + enforce_workgroup_configuration         = false
          + publish_cloudwatch_metrics_enabled      = true
          + requester_pays_enabled                  = false

          + engine_version {
              + effective_engine_version = (known after apply)
              + selected_engine_version  = "Athena engine version 3"
            }

          + result_configuration {
              + output_location = (known after apply)
            }
        }
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_index_stack will be created
  + resource "aws_cloudformation_stack" "sbeacon_terms_index_stack" {
      + id            = (known after apply)
      + name          = "sbeacon-terms-index-stack"
      + outputs       = (known after apply)
      + parameters    = {
          + "DatabaseName" = "sbeacon_metadata"
          + "TableName"    = "sbeacon_terms_index"
        }
      + policy_body   = (known after apply)
      + region        = "ap-southeast-3"
      + tags_all      = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + template_body = (known after apply)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be created
  + resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
      + id            = (known after apply)
      + name          = "sbeacon-terms-stack"
      + outputs       = (known after apply)
      + parameters    = {
          + "DatabaseName" = "sbeacon_metadata"
          + "TableName"    = "sbeacon_terms"
        }
      + policy_body   = (known after apply)
      + region        = "ap-southeast-3"
      + tags_all      = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + template_body = (known after apply)
    }

  # module.sbeacon.aws_cloudfront_cache_policy.api will be created
  + resource "aws_cloudfront_cache_policy" "api" {
      + arn         = (known after apply)
      + default_ttl = 0
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 0
      + min_ttl     = 0
      + name        = "sbeacon-backend-api"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }
          + headers_config {
              + header_behavior = "none"
            }
          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.sbeacon.aws_cloudfront_origin_request_policy.api will be created
  + resource "aws_cloudfront_origin_request_policy" "api" {
      + arn  = (known after apply)
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "sbeacon-backend-api"

      + cookies_config {
          + cookie_behavior = "none"
        }

      + headers_config {
          + header_behavior = "allExcept"

          + headers {
              + items = [
                  + "Host",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # module.sbeacon.aws_dynamodb_table.anscestor_terms will be created
  + resource "aws_dynamodb_table" "anscestor_terms" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "term"
      + id               = (known after apply)
      + name             = "sbeacon-Anscestors"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "term"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinic_jobs will be created
  + resource "aws_dynamodb_table" "clinic_jobs" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "job_id"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinic-jobs"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "job_id"
          + type = "S"
        }
      + attribute {
          + name = "project_name"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "project_name"
          + name               = "project-name-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)

          + key_schema (known after apply)

          + warm_throughput (known after apply)
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_annotations will be created
  + resource "aws_dynamodb_table" "clinical_annotations" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "project_job"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinical-annotations"
      + range_key        = "annotation_name"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "annotation_name"
          + type = "S"
        }
      + attribute {
          + name = "project_job"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_variants will be created
  + resource "aws_dynamodb_table" "clinical_variants" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "project_job"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinical-variants"
      + range_key        = "collection_name"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "collection_name"
          + type = "S"
        }
      + attribute {
          + name = "project_job"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_cli_upload will be created
  + resource "aws_dynamodb_table" "dataportal_cli_upload" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-cli-upload"
      + range_key        = "upload_id"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "project_name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }
      + attribute {
          + name = "upload_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "project_name"
          + name               = "cli-uploads-project-name-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "uid"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)

          + key_schema (known after apply)

          + warm_throughput (known after apply)
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ExpirationTime"
          + enabled        = true
        }

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_locks_table will be created
  + resource "aws_dynamodb_table" "dataportal_locks_table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockId"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-mutex-locks"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockId"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ExpirationTime"
          + enabled        = true
        }

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_pricing_cache will be created
  + resource "aws_dynamodb_table" "dataportal_pricing_cache" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "resource"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-pricing-cache"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "resource"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ExpirationTime"
          + enabled        = true
        }

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.descendant_terms will be created
  + resource "aws_dynamodb_table" "descendant_terms" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "term"
      + id               = (known after apply)
      + name             = "sbeacon-Descendants"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "term"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.juptyer_notebooks will be created
  + resource "aws_dynamodb_table" "juptyer_notebooks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-juptyer-notebooks"
      + range_key        = "instanceName"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "instanceName"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.ontologies will be created
  + resource "aws_dynamodb_table" "ontologies" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "sbeacon-Ontologies"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be created
  + resource "aws_dynamodb_table" "project_users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-project-users"
      + range_key        = "uid"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "uid"
          + name               = "uid-index"
          + non_key_attributes = []
          + projection_type    = "KEYS_ONLY"
          + range_key          = "name"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)

          + key_schema (known after apply)

          + warm_throughput (known after apply)
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.projects will be created
  + resource "aws_dynamodb_table" "projects" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-projects"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.saved_queries will be created
  + resource "aws_dynamodb_table" "saved_queries" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-saved-queries"
      + range_key        = "name"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon-dataportal-users-quota will be created
  + resource "aws_dynamodb_table" "sbeacon-dataportal-users-quota" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-users-quota"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Name"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon_dataportal_users_info will be created
  + resource "aws_dynamodb_table" "sbeacon_dataportal_users_info" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-users-info"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.vcfs will be created
  + resource "aws_dynamodb_table" "vcfs" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "vcfLocation"
      + id               = (known after apply)
      + name             = "sbeacon-vcfs"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "vcfLocation"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_glue_catalog_database.metadata-database will be created
  + resource "aws_glue_catalog_database" "metadata-database" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "sbeacon_metadata"
      + region       = "ap-southeast-3"
      + tags_all     = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + create_table_default_permission (known after apply)
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be created
  + resource "aws_glue_catalog_table" "sbeacon-analyses" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_analyses"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_vcfsampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "aligner"
              + type = "string"
            }
          + columns {
              + name = "analysisdate"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "pipelinename"
              + type = "string"
            }
          + columns {
              + name = "pipelineref"
              + type = "string"
            }
          + columns {
              + name = "variantcaller"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-analyses-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_analyses_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_vcfsampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "aligner"
              + type = "string"
            }
          + columns {
              + name = "analysisdate"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "pipelinename"
              + type = "string"
            }
          + columns {
              + name = "pipelineref"
              + type = "string"
            }
          + columns {
              + name = "variantcaller"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be created
  + resource "aws_glue_catalog_table" "sbeacon-biosamples" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_biosamples"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosamplestatus"
              + type = "string"
            }
          + columns {
              + name = "collectiondate"
              + type = "string"
            }
          + columns {
              + name = "collectionmoment"
              + type = "string"
            }
          + columns {
              + name = "diagnosticmarkers"
              + type = "string"
            }
          + columns {
              + name = "histologicaldiagnosis"
              + type = "string"
            }
          + columns {
              + name = "measurements"
              + type = "string"
            }
          + columns {
              + name = "obtentionprocedure"
              + type = "string"
            }
          + columns {
              + name = "pathologicalstage"
              + type = "string"
            }
          + columns {
              + name = "pathologicaltnmfinding"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sampleorigindetail"
              + type = "string"
            }
          + columns {
              + name = "sampleorigintype"
              + type = "string"
            }
          + columns {
              + name = "sampleprocessing"
              + type = "string"
            }
          + columns {
              + name = "samplestorage"
              + type = "string"
            }
          + columns {
              + name = "tumorgrade"
              + type = "string"
            }
          + columns {
              + name = "tumorprogression"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "notes"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-biosamples-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_biosamples_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosamplestatus"
              + type = "string"
            }
          + columns {
              + name = "collectiondate"
              + type = "string"
            }
          + columns {
              + name = "collectionmoment"
              + type = "string"
            }
          + columns {
              + name = "diagnosticmarkers"
              + type = "string"
            }
          + columns {
              + name = "histologicaldiagnosis"
              + type = "string"
            }
          + columns {
              + name = "measurements"
              + type = "string"
            }
          + columns {
              + name = "obtentionprocedure"
              + type = "string"
            }
          + columns {
              + name = "pathologicalstage"
              + type = "string"
            }
          + columns {
              + name = "pathologicaltnmfinding"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sampleorigindetail"
              + type = "string"
            }
          + columns {
              + name = "sampleorigintype"
              + type = "string"
            }
          + columns {
              + name = "sampleprocessing"
              + type = "string"
            }
          + columns {
              + name = "samplestorage"
              + type = "string"
            }
          + columns {
              + name = "tumorgrade"
              + type = "string"
            }
          + columns {
              + name = "tumorprogression"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "notes"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be created
  + resource "aws_glue_catalog_table" "sbeacon-datasets" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_datasets"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_assemblyid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_datasetname"
              + type = "string"
            }
          + columns {
              + name = "_vcflocations"
              + type = "string"
            }
          + columns {
              + name = "_vcfchromosomemap"
              + type = "string"
            }
          + columns {
              + name = "createdatetime"
              + type = "string"
            }
          + columns {
              + name = "datauseconditions"
              + type = "string"
            }
          + columns {
              + name = "description"
              + type = "string"
            }
          + columns {
              + name = "externalurl"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "name"
              + type = "string"
            }
          + columns {
              + name = "updatedatetime"
              + type = "string"
            }
          + columns {
              + name = "version"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-datasets-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_datasets_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_assemblyid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_datasetname"
              + type = "string"
            }
          + columns {
              + name = "_vcflocations"
              + type = "string"
            }
          + columns {
              + name = "_vcfchromosomemap"
              + type = "string"
            }
          + columns {
              + name = "createdatetime"
              + type = "string"
            }
          + columns {
              + name = "datauseconditions"
              + type = "string"
            }
          + columns {
              + name = "description"
              + type = "string"
            }
          + columns {
              + name = "externalurl"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "name"
              + type = "string"
            }
          + columns {
              + name = "updatedatetime"
              + type = "string"
            }
          + columns {
              + name = "version"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be created
  + resource "aws_glue_catalog_table" "sbeacon-individuals" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_individuals"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "diseases"
              + type = "string"
            }
          + columns {
              + name = "ethnicity"
              + type = "string"
            }
          + columns {
              + name = "exposures"
              + type = "string"
            }
          + columns {
              + name = "geographicorigin"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "interventionsorprocedures"
              + type = "string"
            }
          + columns {
              + name = "karyotypicsex"
              + type = "string"
            }
          + columns {
              + name = "measures"
              + type = "string"
            }
          + columns {
              + name = "pedigrees"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sex"
              + type = "string"
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-individuals-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_individuals_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "diseases"
              + type = "string"
            }
          + columns {
              + name = "ethnicity"
              + type = "string"
            }
          + columns {
              + name = "exposures"
              + type = "string"
            }
          + columns {
              + name = "geographicorigin"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "interventionsorprocedures"
              + type = "string"
            }
          + columns {
              + name = "karyotypicsex"
              + type = "string"
            }
          + columns {
              + name = "measures"
              + type = "string"
            }
          + columns {
              + name = "pedigrees"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sex"
              + type = "string"
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be created
  + resource "aws_glue_catalog_table" "sbeacon-relations" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_relations"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = (known after apply)
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "datasetid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "analysisid"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be created
  + resource "aws_glue_catalog_table" "sbeacon-runs" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_runs"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
      
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.